import com.alibaba.fastjson.JSON;
import com.alibaba.fastjson.JSONObject;
import com.alibaba.fastjson.TypeReference;
import com.digitforce.algorithm.dto.ReplResult;
import com.digitforce.algorithm.dto.ReplenishmentLog;

import java.lang.reflect.Type;

public class testLogParse {


    final static Type type = new TypeReference<ReplenishmentLog>() {}.getType();
    final static Type type1 = new TypeReference<ReplResult>() {}.getType();

    public static void main(String[] args) {
//        String logStr = "{\n" +
//                "                \"name\": null,\n" +
//                "                \"subLog\": {\n" +
//                "                    \"补货量\": {\n" +
//                "                        \"name\": null,\n" +
//                "                        \"subLog\": {\n" +
//                "                            \"最小净需求\": {\n" +
//                "                                \"name\": null,\n" +
//                "                                \"subLog\": {\n" +
//                "                                    \"展望期B净需求\": {\n" +
//                "                                        \"name\": \"展望期B净需求\",\n" +
//                "                                        \"subLog\": {\n" +
//                "                                            \"毛需求\": {\n" +
//                "                                                \"name\": \"毛需求\",\n" +
//                "                                                \"subLog\": {\n" +
//                "                                                    \"毛需求_起订点\": {\n" +
//                "                                                        \"name\": \"毛需求_起订点\",\n" +
//                "                                                        \"subLog\": {\n" +
//                "                                                            \"毛需求_安全库存\": {\n" +
//                "                                                                \"name\": \"毛需求_安全库存\",\n" +
//                "                                                                \"subLog\": {\n" +
//                "                                                                    \"毛需求_安全库存下界\": {\n" +
//                "                                                                        \"name\": \"毛需求_安全库存下界\",\n" +
//                "                                                                        \"subLog\": {},\n" +
//                "                                                                        \"formulas\": [\n" +
//                "                                                                            {\n" +
//                "                                                                                \"expression\": \"min(min(过去7天日均销, 过去30天日均销), 未来7天预测日均销) * (安全库存限制系数 + 展望期天数)\",\n" +
//                "                                                                                \"parameters\": {\n" +
//                "                                                                                    \"安全库存限制系数\": 5.0,\n" +
//                "                                                                                    \"过去7天日均销\": 0.0,\n" +
//                "                                                                                    \"过去30天日均销\": 0.0333333,\n" +
//                "                                                                                    \"展望期天数\": 8.0,\n" +
//                "                                                                                    \"未来7天预测日均销\": 0.0\n" +
//                "                                                                                },\n" +
//                "                                                                                \"resultName\": \"毛需求_安全库存下界\",\n" +
//                "                                                                                \"value\": 0.0\n" +
//                "                                                                            }\n" +
//                "                                                                        ],\n" +
//                "                                                                        \"stage\": \"最小服务水平 [0.75]_展望期B [2022-05-22至2022-05-25]\"\n" +
//                "                                                                    }\n" +
//                "                                                                },\n" +
//                "                                                                \"formulas\": [\n" +
//                "                                                                    {\n" +
//                "                                                                        \"expression\": \"获取满足服务水平时的T值\",\n" +
//                "                                                                        \"parameters\": {\n" +
//                "                                                                            \"服务水平\": 0.75\n" +
//                "                                                                        },\n" +
//                "                                                                        \"resultName\": \"T值\",\n" +
//                "                                                                        \"value\": 1.1703459095028927\n" +
//                "                                                                    },\n" +
//                "                                                                    {\n" +
//                "                                                                        \"expression\": \"min(T值 * sqrt(方差估计), 毛需求_安全库存下界)\",\n" +
//                "                                                                        \"parameters\": {\n" +
//                "                                                                            \"毛需求_安全库存下界\": 0.0,\n" +
//                "                                                                            \"T值\": 1.1703459095028927,\n" +
//                "                                                                            \"方差估计\": 0.1215213358070501\n" +
//                "                                                                        },\n" +
//                "                                                                        \"resultName\": \"毛需求_安全库存\",\n" +
//                "                                                                        \"value\": 0.0\n" +
//                "                                                                    }\n" +
//                "                                                                ],\n" +
//                "                                                                \"stage\": \"最小服务水平 [0.75]_展望期B [2022-05-22至2022-05-25]\"\n" +
//                "                                                            }\n" +
//                "                                                        },\n" +
//                "                                                        \"formulas\": [\n" +
//                "                                                            {\n" +
//                "                                                                \"expression\": \"max(最低库存, 展望期销量预测 + 毛需求_安全库存)\",\n" +
//                "                                                                \"parameters\": {\n" +
//                "                                                                    \"最低库存\": 0.0,\n" +
//                "                                                                    \"毛需求_安全库存\": 0.0,\n" +
//                "                                                                    \"展望期销量预测\": 0.0\n" +
//                "                                                                },\n" +
//                "                                                                \"resultName\": \"毛需求_起订点\",\n" +
//                "                                                                \"value\": 0.0\n" +
//                "                                                            }\n" +
//                "                                                        ],\n" +
//                "                                                        \"stage\": \"最小服务水平 [0.75]_展望期B [2022-05-22至2022-05-25]\"\n" +
//                "                                                    }\n" +
//                "                                                },\n" +
//                "                                                \"formulas\": [\n" +
//                "                                                    {\n" +
//                "                                                        \"expression\": \"max(毛需求_起订点, 最小陈列量)\",\n" +
//                "                                                        \"parameters\": {\n" +
//                "                                                            \"毛需求_起订点\": 0.0,\n" +
//                "                                                            \"最小陈列量\": 3.0\n" +
//                "                                                        },\n" +
//                "                                                        \"resultName\": \"毛需求\",\n" +
//                "                                                        \"value\": 3.0\n" +
//                "                                                    },\n" +
//                "                                                    {\n" +
//                "                                                        \"expression\": \"Math.ceil(毛需求)\",\n" +
//                "                                                        \"parameters\": {},\n" +
//                "                                                        \"resultName\": \"毛需求\",\n" +
//                "                                                        \"value\": 3.0\n" +
//                "                                                    }\n" +
//                "                                                ],\n" +
//                "                                                \"stage\": \"最小服务水平 [0.75]_展望期B [2022-05-22至2022-05-25]\"\n" +
//                "                                            }\n" +
//                "                                        },\n" +
//                "                                        \"formulas\": [\n" +
//                "                                            {\n" +
//                "                                                \"expression\": \"毛需求 - 库内库存 - 在途库存\",\n" +
//                "                                                \"parameters\": {\n" +
//                "                                                    \"在途库存\": 0.0,\n" +
//                "                                                    \"毛需求\": 3.0,\n" +
//                "                                                    \"库内库存\": 0.0\n" +
//                "                                                },\n" +
//                "                                                \"resultName\": \"展望期B净需求\",\n" +
//                "                                                \"value\": 3.0\n" +
//                "                                            }\n" +
//                "                                        ],\n" +
//                "                                        \"stage\": \"最小服务水平 [0.75]_展望期B [2022-05-22至2022-05-25]\"\n" +
//                "                                    },\n" +
//                "                                    \"展望期A净需求\": {\n" +
//                "                                        \"name\": null,\n" +
//                "                                        \"subLog\": {\n" +
//                "                                            \"毛需求\": {\n" +
//                "                                                \"name\": null,\n" +
//                "                                                \"subLog\": {\n" +
//                "                                                    \"毛需求_起订点\": {\n" +
//                "                                                        \"name\": \"毛需求_起订点\",\n" +
//                "                                                        \"subLog\": {\n" +
//                "                                                            \"毛需求_安全库存\": {\n" +
//                "                                                                \"name\": \"毛需求_安全库存\",\n" +
//                "                                                                \"subLog\": {\n" +
//                "                                                                    \"毛需求_安全库存下界\": {\n" +
//                "                                                                        \"name\": \"毛需求_安全库存下界\",\n" +
//                "                                                                        \"subLog\": {},\n" +
//                "                                                                        \"formulas\": [\n" +
//                "                                                                            {\n" +
//                "                                                                                \"expression\": \"min(min(过去7天日均销, 过去30天日均销), 未来7天预测日均销) * (安全库存限制系数 + 展望期天数)\",\n" +
//                "                                                                                \"parameters\": {\n" +
//                "                                                                                    \"安全库存限制系数\": 5.0,\n" +
//                "                                                                                    \"过去7天日均销\": 0.0,\n" +
//                "                                                                                    \"过去30天日均销\": 0.0333333,\n" +
//                "                                                                                    \"展望期天数\": 8.0,\n" +
//                "                                                                                    \"未来7天预测日均销\": 0.0\n" +
//                "                                                                                },\n" +
//                "                                                                                \"resultName\": \"毛需求_安全库存下界\",\n" +
//                "                                                                                \"value\": 0.0\n" +
//                "                                                                            }\n" +
//                "                                                                        ],\n" +
//                "                                                                        \"stage\": \"最小服务水平 [0.75]_展望期A [2022-05-17至2022-05-25]\"\n" +
//                "                                                                    }\n" +
//                "                                                                },\n" +
//                "                                                                \"formulas\": [\n" +
//                "                                                                    {\n" +
//                "                                                                        \"expression\": \"获取满足服务水平时的T值\",\n" +
//                "                                                                        \"parameters\": {\n" +
//                "                                                                            \"服务水平\": 0.75\n" +
//                "                                                                        },\n" +
//                "                                                                        \"resultName\": \"T值\",\n" +
//                "                                                                        \"value\": 1.1703459095028927\n" +
//                "                                                                    },\n" +
//                "                                                                    {\n" +
//                "                                                                        \"expression\": \"min(T值 * sqrt(方差估计), 毛需求_安全库存下界)\",\n" +
//                "                                                                        \"parameters\": {\n" +
//                "                                                                            \"毛需求_安全库存下界\": 0.0,\n" +
//                "                                                                            \"T值\": 1.1703459095028927,\n" +
//                "                                                                            \"方差估计\": 0.6362132627755793\n" +
//                "                                                                        },\n" +
//                "                                                                        \"resultName\": \"毛需求_安全库存\",\n" +
//                "                                                                        \"value\": 0.0\n" +
//                "                                                                    }\n" +
//                "                                                                ],\n" +
//                "                                                                \"stage\": \"最小服务水平 [0.75]_展望期A [2022-05-17至2022-05-25]\"\n" +
//                "                                                            }\n" +
//                "                                                        },\n" +
//                "                                                        \"formulas\": [\n" +
//                "                                                            {\n" +
//                "                                                                \"expression\": \"max(最低库存, 展望期销量预测 + 毛需求_安全库存)\",\n" +
//                "                                                                \"parameters\": {\n" +
//                "                                                                    \"最低库存\": 0.0,\n" +
//                "                                                                    \"毛需求_安全库存\": 0.0,\n" +
//                "                                                                    \"展望期销量预测\": 0.0\n" +
//                "                                                                },\n" +
//                "                                                                \"resultName\": \"毛需求_起订点\",\n" +
//                "                                                                \"value\": 0.0\n" +
//                "                                                            }\n" +
//                "                                                        ],\n" +
//                "                                                        \"stage\": \"最小服务水平 [0.75]_展望期A [2022-05-17至2022-05-25]\"\n" +
//                "                                                    }\n" +
//                "                                                },\n" +
//                "                                                \"formulas\": [\n" +
//                "                                                    {\n" +
//                "                                                        \"expression\": \"因为库内库存 + 在途库存 >= 毛需求_起订点\",\n" +
//                "                                                        \"parameters\": {\n" +
//                "                                                            \"在途库存\": 0.0,\n" +
//                "                                                            \"毛需求_起订点\": 0.0,\n" +
//                "                                                            \"库内库存\": 19.0\n" +
//                "                                                        },\n" +
//                "                                                        \"resultName\": \"补货量\",\n" +
//                "                                                        \"value\": 0.0\n" +
//                "                                                    }\n" +
//                "                                                ],\n" +
//                "                                                \"stage\": null\n" +
//                "                                            }\n" +
//                "                                        },\n" +
//                "                                        \"formulas\": [],\n" +
//                "                                        \"stage\": null\n" +
//                "                                    }\n" +
//                "                                },\n" +
//                "                                \"formulas\": [],\n" +
//                "                                \"stage\": null\n" +
//                "                            }\n" +
//                "                        },\n" +
//                "                        \"formulas\": [],\n" +
//                "                        \"stage\": null\n" +
//                "                    }\n" +
//                "                },\n" +
//                "                \"formulas\": [],\n" +
//                "                \"stage\": null\n" +
//                "            }";
//
//
//        ReplenishmentLog rlog = JSON.parseObject(logStr, type);
//        rlog.parseLog(false);

        String json = "{\n" +
                "            \"replQuant\": 0.0,\n" +
                "            \"replenishmentLog\": {\n" +
                "                \"name\": null,\n" +
                "                \"subLog\": {\n" +
                "                    \"补货量\": {\n" +
                "                        \"name\": null,\n" +
                "                        \"subLog\": {\n" +
                "                            \"最小净需求\": {\n" +
                "                                \"name\": null,\n" +
                "                                \"subLog\": {\n" +
                "                                    \"展望期B净需求\": {\n" +
                "                                        \"name\": \"展望期B净需求\",\n" +
                "                                        \"subLog\": {\n" +
                "                                            \"毛需求\": {\n" +
                "                                                \"name\": \"毛需求\",\n" +
                "                                                \"subLog\": {\n" +
                "                                                    \"毛需求_起订点\": {\n" +
                "                                                        \"name\": \"毛需求_起订点\",\n" +
                "                                                        \"subLog\": {\n" +
                "                                                            \"毛需求_安全库存\": {\n" +
                "                                                                \"name\": \"毛需求_安全库存\",\n" +
                "                                                                \"subLog\": {\n" +
                "                                                                    \"毛需求_安全库存下界\": {\n" +
                "                                                                        \"name\": \"毛需求_安全库存下界\",\n" +
                "                                                                        \"subLog\": {},\n" +
                "                                                                        \"formulas\": [\n" +
                "                                                                            {\n" +
                "                                                                                \"expression\": \"min(min(过去7天日均销, 过去30天日均销), 未来7天预测日均销) * (安全库存限制系数 + 展望期天数)\",\n" +
                "                                                                                \"parameters\": {\n" +
                "                                                                                    \"安全库存限制系数\": 5.0,\n" +
                "                                                                                    \"过去7天日均销\": 0.0,\n" +
                "                                                                                    \"过去30天日均销\": 0.0333333,\n" +
                "                                                                                    \"展望期天数\": 8.0,\n" +
                "                                                                                    \"未来7天预测日均销\": 0.0\n" +
                "                                                                                },\n" +
                "                                                                                \"resultName\": \"毛需求_安全库存下界\",\n" +
                "                                                                                \"value\": 0.0\n" +
                "                                                                            }\n" +
                "                                                                        ],\n" +
                "                                                                        \"stage\": \"最小服务水平 [0.75]_展望期B [2022-05-22至2022-05-25]\"\n" +
                "                                                                    }\n" +
                "                                                                },\n" +
                "                                                                \"formulas\": [\n" +
                "                                                                    {\n" +
                "                                                                        \"expression\": \"获取满足服务水平时的T值\",\n" +
                "                                                                        \"parameters\": {\n" +
                "                                                                            \"服务水平\": 0.75\n" +
                "                                                                        },\n" +
                "                                                                        \"resultName\": \"T值\",\n" +
                "                                                                        \"value\": 1.1703459095028927\n" +
                "                                                                    },\n" +
                "                                                                    {\n" +
                "                                                                        \"expression\": \"min(T值 * sqrt(方差估计), 毛需求_安全库存下界)\",\n" +
                "                                                                        \"parameters\": {\n" +
                "                                                                            \"毛需求_安全库存下界\": 0.0,\n" +
                "                                                                            \"T值\": 1.1703459095028927,\n" +
                "                                                                            \"方差估计\": 0.1215213358070501\n" +
                "                                                                        },\n" +
                "                                                                        \"resultName\": \"毛需求_安全库存\",\n" +
                "                                                                        \"value\": 0.0\n" +
                "                                                                    }\n" +
                "                                                                ],\n" +
                "                                                                \"stage\": \"最小服务水平 [0.75]_展望期B [2022-05-22至2022-05-25]\"\n" +
                "                                                            }\n" +
                "                                                        },\n" +
                "                                                        \"formulas\": [\n" +
                "                                                            {\n" +
                "                                                                \"expression\": \"max(最低库存, 展望期销量预测 + 毛需求_安全库存)\",\n" +
                "                                                                \"parameters\": {\n" +
                "                                                                    \"最低库存\": 0.0,\n" +
                "                                                                    \"毛需求_安全库存\": 0.0,\n" +
                "                                                                    \"展望期销量预测\": 0.0\n" +
                "                                                                },\n" +
                "                                                                \"resultName\": \"毛需求_起订点\",\n" +
                "                                                                \"value\": 0.0\n" +
                "                                                            }\n" +
                "                                                        ],\n" +
                "                                                        \"stage\": \"最小服务水平 [0.75]_展望期B [2022-05-22至2022-05-25]\"\n" +
                "                                                    }\n" +
                "                                                },\n" +
                "                                                \"formulas\": [\n" +
                "                                                    {\n" +
                "                                                        \"expression\": \"max(毛需求_起订点, 最小陈列量)\",\n" +
                "                                                        \"parameters\": {\n" +
                "                                                            \"毛需求_起订点\": 0.0,\n" +
                "                                                            \"最小陈列量\": 3.0\n" +
                "                                                        },\n" +
                "                                                        \"resultName\": \"毛需求\",\n" +
                "                                                        \"value\": 3.0\n" +
                "                                                    },\n" +
                "                                                    {\n" +
                "                                                        \"expression\": \"Math.ceil(毛需求)\",\n" +
                "                                                        \"parameters\": {},\n" +
                "                                                        \"resultName\": \"毛需求\",\n" +
                "                                                        \"value\": 3.0\n" +
                "                                                    }\n" +
                "                                                ],\n" +
                "                                                \"stage\": \"最小服务水平 [0.75]_展望期B [2022-05-22至2022-05-25]\"\n" +
                "                                            }\n" +
                "                                        },\n" +
                "                                        \"formulas\": [\n" +
                "                                            {\n" +
                "                                                \"expression\": \"毛需求 - 库内库存 - 在途库存\",\n" +
                "                                                \"parameters\": {\n" +
                "                                                    \"在途库存\": 0.0,\n" +
                "                                                    \"毛需求\": 3.0,\n" +
                "                                                    \"库内库存\": 0.0\n" +
                "                                                },\n" +
                "                                                \"resultName\": \"展望期B净需求\",\n" +
                "                                                \"value\": 3.0\n" +
                "                                            }\n" +
                "                                        ],\n" +
                "                                        \"stage\": \"最小服务水平 [0.75]_展望期B [2022-05-22至2022-05-25]\"\n" +
                "                                    },\n" +
                "                                    \"展望期A净需求\": {\n" +
                "                                        \"name\": null,\n" +
                "                                        \"subLog\": {\n" +
                "                                            \"毛需求\": {\n" +
                "                                                \"name\": null,\n" +
                "                                                \"subLog\": {\n" +
                "                                                    \"毛需求_起订点\": {\n" +
                "                                                        \"name\": \"毛需求_起订点\",\n" +
                "                                                        \"subLog\": {\n" +
                "                                                            \"毛需求_安全库存\": {\n" +
                "                                                                \"name\": \"毛需求_安全库存\",\n" +
                "                                                                \"subLog\": {\n" +
                "                                                                    \"毛需求_安全库存下界\": {\n" +
                "                                                                        \"name\": \"毛需求_安全库存下界\",\n" +
                "                                                                        \"subLog\": {},\n" +
                "                                                                        \"formulas\": [\n" +
                "                                                                            {\n" +
                "                                                                                \"expression\": \"min(min(过去7天日均销, 过去30天日均销), 未来7天预测日均销) * (安全库存限制系数 + 展望期天数)\",\n" +
                "                                                                                \"parameters\": {\n" +
                "                                                                                    \"安全库存限制系数\": 5.0,\n" +
                "                                                                                    \"过去7天日均销\": 0.0,\n" +
                "                                                                                    \"过去30天日均销\": 0.0333333,\n" +
                "                                                                                    \"展望期天数\": 8.0,\n" +
                "                                                                                    \"未来7天预测日均销\": 0.0\n" +
                "                                                                                },\n" +
                "                                                                                \"resultName\": \"毛需求_安全库存下界\",\n" +
                "                                                                                \"value\": 0.0\n" +
                "                                                                            }\n" +
                "                                                                        ],\n" +
                "                                                                        \"stage\": \"最小服务水平 [0.75]_展望期A [2022-05-17至2022-05-25]\"\n" +
                "                                                                    }\n" +
                "                                                                },\n" +
                "                                                                \"formulas\": [\n" +
                "                                                                    {\n" +
                "                                                                        \"expression\": \"获取满足服务水平时的T值\",\n" +
                "                                                                        \"parameters\": {\n" +
                "                                                                            \"服务水平\": 0.75\n" +
                "                                                                        },\n" +
                "                                                                        \"resultName\": \"T值\",\n" +
                "                                                                        \"value\": 1.1703459095028927\n" +
                "                                                                    },\n" +
                "                                                                    {\n" +
                "                                                                        \"expression\": \"min(T值 * sqrt(方差估计), 毛需求_安全库存下界)\",\n" +
                "                                                                        \"parameters\": {\n" +
                "                                                                            \"毛需求_安全库存下界\": 0.0,\n" +
                "                                                                            \"T值\": 1.1703459095028927,\n" +
                "                                                                            \"方差估计\": 0.6362132627755793\n" +
                "                                                                        },\n" +
                "                                                                        \"resultName\": \"毛需求_安全库存\",\n" +
                "                                                                        \"value\": 0.0\n" +
                "                                                                    }\n" +
                "                                                                ],\n" +
                "                                                                \"stage\": \"最小服务水平 [0.75]_展望期A [2022-05-17至2022-05-25]\"\n" +
                "                                                            }\n" +
                "                                                        },\n" +
                "                                                        \"formulas\": [\n" +
                "                                                            {\n" +
                "                                                                \"expression\": \"max(最低库存, 展望期销量预测 + 毛需求_安全库存)\",\n" +
                "                                                                \"parameters\": {\n" +
                "                                                                    \"最低库存\": 0.0,\n" +
                "                                                                    \"毛需求_安全库存\": 0.0,\n" +
                "                                                                    \"展望期销量预测\": 0.0\n" +
                "                                                                },\n" +
                "                                                                \"resultName\": \"毛需求_起订点\",\n" +
                "                                                                \"value\": 0.0\n" +
                "                                                            }\n" +
                "                                                        ],\n" +
                "                                                        \"stage\": \"最小服务水平 [0.75]_展望期A [2022-05-17至2022-05-25]\"\n" +
                "                                                    }\n" +
                "                                                },\n" +
                "                                                \"formulas\": [\n" +
                "                                                    {\n" +
                "                                                        \"expression\": \"因为库内库存 + 在途库存 >= 毛需求_起订点\",\n" +
                "                                                        \"parameters\": {\n" +
                "                                                            \"在途库存\": 0.0,\n" +
                "                                                            \"毛需求_起订点\": 0.0,\n" +
                "                                                            \"库内库存\": 19.0\n" +
                "                                                        },\n" +
                "                                                        \"resultName\": \"补货量\",\n" +
                "                                                        \"value\": 0.0\n" +
                "                                                    }\n" +
                "                                                ],\n" +
                "                                                \"stage\": null\n" +
                "                                            }\n" +
                "                                        },\n" +
                "                                        \"formulas\": [],\n" +
                "                                        \"stage\": null\n" +
                "                                    }\n" +
                "                                },\n" +
                "                                \"formulas\": [],\n" +
                "                                \"stage\": null\n" +
                "                            }\n" +
                "                        },\n" +
                "                        \"formulas\": [],\n" +
                "                        \"stage\": null\n" +
                "                    }\n" +
                "                },\n" +
                "                \"formulas\": [],\n" +
                "                \"stage\": null\n" +
                "            },\n" +
                "            \"strategy\": \"残差安全库存策略+常规补货策略\",\n" +
                "            \"safetyStock\": 0.0,\n" +
                "            \"shopId\": \"1004\"\n" +
                "        }";

        ReplResult replResult = JSON.parseObject(json, type1);
        System.out.println("finish!");

    }


}
